#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for dev</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.thumb_flow.aws_iam_policy.bedrock_access will be created
  + resource "aws_iam_policy" "bedrock_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows Lambda function to invoke Amazon Bedrock models"
      + id               = (known after apply)
      + name             = "thumbflow-thumbnail-generator-dev-bedrock-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "bedrock:InvokeModel",
                          + "bedrock:ListFoundationModels",
                          + "bedrock:GetFoundationModel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_policy.dynamodb_access will be created
  + resource "aws_iam_policy" "dynamodb_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for Lambda functions to access DynamoDB tables"
      + id               = (known after apply)
      + name             = "dev-thumbflow-dynamodb-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_policy.thumbnail_bucket_access will be created
  + resource "aws_iam_policy" "thumbnail_bucket_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows Lambda function to access thumbnail S3 bucket"
      + id               = (known after apply)
      + name             = "thumbflow-thumbnail-generator-dev-thumbnail-bucket-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_policy.thumbnail_function_sqs_receive will be created
  + resource "aws_iam_policy" "thumbnail_function_sqs_receive" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows thumbnail generator function to receive messages from SQS"
      + id               = (known after apply)
      + name             = "thumbflow-thumbnail-generator-dev-sqs-receive-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_policy.upload_function_sqs_publish will be created
  + resource "aws_iam_policy" "upload_function_sqs_publish" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows upload Lambda function to publish messages to SQS"
      + id               = (known after apply)
      + name             = "thumbflow-upload-handler-dev-sqs-publish-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.bedrock_access will be created
  + resource "aws_iam_role_policy_attachment" "bedrock_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.thumbnail_bucket_access will be created
  + resource "aws_iam_role_policy_attachment" "thumbnail_bucket_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.thumbnail_function_dynamodb_access will be created
  + resource "aws_iam_role_policy_attachment" "thumbnail_function_dynamodb_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.thumbnail_function_sqs_receive will be created
  + resource "aws_iam_role_policy_attachment" "thumbnail_function_sqs_receive" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.upload_function_dynamodb_access will be created
  + resource "aws_iam_role_policy_attachment" "upload_function_dynamodb_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-upload-handler-dev-execution-role"
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.upload_function_sqs_publish will be created
  + resource "aws_iam_role_policy_attachment" "upload_function_sqs_publish" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-upload-handler-dev-execution-role"
    }

  # module.thumb_flow.aws_lambda_event_source_mapping.thumbnail_generator_sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "thumbnail_generator_sqs_trigger" {
      + arn                           = (known after apply)
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + region                        = "us-east-1"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_api.this will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "API Gateway for ThumbFlow dev environment"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "dev-thumbflow-api"
      + protocol_type                = "HTTP"
      + region                       = "us-east-1"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_headers     = [
              + "Authorization",
              + "Content-Type",
              + "X-Amz-Date",
              + "X-Api-Key",
            ]
          + allow_methods     = [
              + "GET",
              + "OPTIONS",
              + "POST",
              + "PUT",
            ]
          + allow_origins     = [
              + "*",
            ]
          + expose_headers    = [
              + "Content-Length",
              + "Content-Type",
            ]
          + max_age           = 300
        }
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_integration.lambda_integrations["0"] will be created
  + resource "aws_apigatewayv2_integration" "lambda_integrations" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Upload images endpoint"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = 30000
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_route.routes["0"] will be created
  + resource "aws_apigatewayv2_route" "routes" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /images"
      + target             = (known after apply)
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_stage.this will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + region        = "us-east-1"
      + tags          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + path           = "$context.path"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + responseLength = "$context.responseLength"
                  + routeKey       = "$context.routeKey"
                  + status         = "$context.status"
                }
            )
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 10
          + throttling_rate_limit    = 5
        }
    }

  # module.thumb_flow.module.api_gateway.aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/api-gateway/dev-thumbflow-api"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
    }

  # module.thumb_flow.module.api_gateway.aws_lambda_permission.api_gateway_invoke_lambda["0"] will be created
  + resource "aws_lambda_permission" "api_gateway_invoke_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "thumbflow-upload-handler-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-0"
      + statement_id_prefix = (known after apply)
    }

  # module.thumb_flow.module.dynamodb.aws_dynamodb_table.processed_images will be created
  + resource "aws_dynamodb_table" "processed_images" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "thumbflow-processed-images-dev"
      + read_capacity    = (known after apply)
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "workflow_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "workflow_id"
          + name               = "workflow-id-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.thumb_flow.module.dynamodb.aws_dynamodb_table.raw_images will be created
  + resource "aws_dynamodb_table" "raw_images" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "thumbflow-raw-images-dev"
      + read_capacity    = (known after apply)
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "workflow_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "workflow_id"
          + name               = "workflow-id-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.thumb_flow.module.raw_images_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "thumbflow-raw-images-bucket-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.thumb_flow.module.raw_images_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.thumb_flow.module.raw_images_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
    }

  # module.thumb_flow.module.thumbnail_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "thumbflow-thumbnails-bucket-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.thumb_flow.module.thumbnail_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.thumb_flow.module.thumbnail_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
    }

  # module.thumb_flow.module.thumbnail_generation_queue.aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "thumbflow-thumbnail-generation-queue-dev"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "us-east-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_iam_policy.s3_output[0] will be created
  + resource "aws_iam_policy" "s3_output" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows Lambda function to access S3 outputs"
      + id               = (known after apply)
      + name             = "thumbflow-thumbnail-generator-dev-s3-output-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "thumbflow-thumbnail-generator-dev-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_iam_role_policy_attachment.s3_output[0] will be created
  + resource "aws_iam_role_policy_attachment" "s3_output" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "thumbflow-thumbnail-generator-dev"
      + id                             = (known after apply)
      + image_uri                      = "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/thumbnail-generator:0f6ca1d1ea7e869d89110ef879697490b4418332-17279388724"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.thumb_flow.module.upload_function.aws_iam_policy.s3_output[0] will be created
  + resource "aws_iam_policy" "s3_output" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows Lambda function to access S3 outputs"
      + id               = (known after apply)
      + name             = "thumbflow-upload-handler-dev-s3-output-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.module.upload_function.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "thumbflow-upload-handler-dev-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.thumb_flow.module.upload_function.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "thumbflow-upload-handler-dev-execution-role"
    }

  # module.thumb_flow.module.upload_function.aws_iam_role_policy_attachment.s3_output[0] will be created
  + resource "aws_iam_role_policy_attachment" "s3_output" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-upload-handler-dev-execution-role"
    }

  # module.thumb_flow.module.upload_function.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "thumbflow-upload-handler-dev"
      + id                             = (known after apply)
      + image_uri                      = "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/upload-handler:0f6ca1d1ea7e869d89110ef879697490b4418332-17279388724"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_url                   = (known after apply)
  + api_routes                        = {
      + "/images" = (known after apply)
    }
  + processed_images_table_name       = "thumbflow-processed-images-dev"
  + raw_bucket_name                   = (known after apply)
  + raw_images_table_name             = "thumbflow-raw-images-dev"
  + thumbnail_bucket_name             = (known after apply)
  + thumbnail_generator_function_name = "thumbflow-thumbnail-generator-dev"
  + upload_function_name              = "thumbflow-upload-handler-dev"
```

</details>

*Pusher: @blumek, Action: `pull_request`*